      * ---------------------------------------------------------
      *         A B S A  S A V I N G S  S Y S T E M
      *         ***********************************
      *
      * GENERAL PURPOSE DEPENDANT SEGMENT OF SAVINGS DATABASE SVDE25
      *
      *                   S V S E 2 5 5
      *
      *      TOTAL LENGTH = VARIALBLE LENGTH MAX SIZE 114
      *      KEY LENGTH   =  12
      *
      *      PARENT SEGMENT = SVSE251
      * ---------------------------------------------------------
      *
       01  SVSE255-RECORD.
           02 SVSE255-REC-LENGTH        PIC S9(4)      COMP.
      *                            RECORD LENGTH FOR SPECIFIC
      *                            RECORD TYPE
           02 SVSE255-KEY.
             04 SVSE255-RECORD-TYPE     PIC S9(3)      COMP-3.
      *                            USED TO IDENTIFY SPECIFIC
      *                            PURPOSE RECORD TYPES
             04 SVSE255-KEY-FILLER      PIC X(10)
                                         VALUE LOW-VALUES.
      *                            USED FOR OVERRIDING KEY
      *                            STRUCTURES WHICH MAY APPLY
      *                            TO SPECIFIC RECORD TYPES
      *                            INITIALIZED TO LOW-VALUES
           02 SVSE255-DATA              PIC X(100).
      *                            DATA PORTION OF SEGMENT.
      *                            DATA SIZE AND CONTENTS
      *                            DEPENDS ON RECORD TYPE.
      *                            HERE MAXIMUM SIZE IS SPECIFIED.
       01  SVSE255-ITAX-RECORD           REDEFINES
           SVSE255-RECORD.
           02 FILLER                     PIC S9(4)      COMP.
                88 SVSE255-ITAX-REC-LENGTH  VALUE +28.
      *                            RECORD LENGTH
           02 SVSE255-ITAX-KEY.
             04 FILLER                   PIC S9(3)      COMP-3.
                88 SVSE255-ITAX-RECORD-TYPE VALUE 01.
             04 SVSE255-ITAX-KEY-FILLER  PIC X(10).
      *                            VALUE LOW-VALUES.
           02 SVSE255-ITAX-DATA.
              04 SVSE255-ITAX-INT-ACR-PRE-TX-YR
                                         PIC S9(11)V99  COMP-3.
      *                            INTEREST ACRUD AS AT END OF
      *                            PREVIOUS TAX YEAR END
              04 SVSE255-ITAX-INT-ACR-CUR-TX-YR
                                         PIC S9(11)V99  COMP-3.
      *                            INTEREST ACRUD AS AT END OF
      *                            CURRENT TAX YEAR END
       01  SVSE255-TDEP-RECORD           REDEFINES
           SVSE255-RECORD.
      *                            TERM DEPOSITS SPECIFIC DATA
           02 FILLER                     PIC S9(4)      COMP.
                88 SVSE255-TDEP-REC-LENGTH  VALUE +49.
      *                            RECORD LENGTH
           02 SVSE255-TDEP-KEY.
             04 FILLER                   PIC S9(3)      COMP-3.
                88 SVSE255-TDEP-RECORD-TYPE VALUE 02.
             04 SVSE255-TDEP-KEY-FILLER  PIC X(10).
      *                            VALUE LOW-VALUES.
           02 SVSE255-TDEP-DATA.
              04 SVSE255-TDEP-TERM-ID
                                         PIC 99.
      *                            THE TERM PERIOD IDENTIFIER.
      *                            THE TERM DEPOSIT ACCOUNT.
      *                            THE AMOUNT FOR WHICH INTEREST
      *                            IS ACCRUED.
              04 SVSE255-TDEP-INVEST-AMOUNT
                                         PIC S9(15)V99  COMP-3.
      *                            THE CURRENT INVESTMENT AMOUNT OF
      *                            THE TERM DEPOSIT ACCOUNT.
      *                            THE AMOUNT FOR WHICH INTEREST
      *                            IS ACCRUED.
              04 SVSE255-TDEP-INVEST-DATE
                                         PIC S9(9)     COMP-3.
      *                            THE EFFECTIVE START DATE OF THE
      *                            CURRENT OR MOST RECENT TERM
      *                            DEPOSIT INVESTMENT PERIOD.
              04 SVSE255-TDEP-MATURITY-DATE
                                         PIC S9(9)     COMP-3.
      *                            THE EFFECTIVE MATURITY DATE OF THE
      *                            CURRENT OR MOST RECENT TERM
      *                            DEPOSIT INVESTMENT PERIOD.
              04 SVSE255-TDEP-CURR-WNOT-PAID
                                         PIC S9(15)V99  COMP-3.
      *                            THE NOTICES PAID DURING CURRENT DAY
              04 SVSE255-TDEP-MAT-STAT-IND
                                         PIC X.
      *                            INDICATES WHETHER AN ACCOUNT HAD
      *                            A MATURITY STATUS OR NOT.
      *                            USED TO DETERMINE WHEN THE STATUS
      *                            CHANGES FROM MATURITY TO OPEN
      *                            FOR A RE-INVESTMENT.
MV1510        04 SVSE255-TDEP-RATE-OPTION
                                         PIC X.
      *                            INDICATES THE RATE OPTION
      *                            F = FIXED RATE
      *                            P = PRIME LINKED
MV1510        04 SVSE255-TDEP-INVEST-TERM
                                         PIC S9(5)  COMP-3.
      *                            THE CURRENT INVESTMENT TERM OF
      *                            THE TERM DEPOSIT ACCOUNT.
      *                            THE TERM IN DAYS FOR THE
      *                            INVESTMENT.

PK1111 01  SVSE255-TRIAD-RECORD          REDEFINES
           SVSE255-RECORD.
           02 FILLER                     PIC S9(4)      COMP.
SG1410*         88 SVSE255-TRIAD-REC-LENGTH  VALUE +40.
  |             88 SVSE255-TRIAD-REC-LENGTH  VALUE +65.
SG1410          88 SVSE255-TRIAD-OLD-REC-LENGTH  VALUE +40.
      *                            RECORD LENGTH
           02 SVSE255-TRIAD-KEY.
             04 FILLER                   PIC S9(3)      COMP-3.
                88 SVSE255-TRIAD-RECORD-TYPE VALUE 03.
             04 SVSE255-TRIAD-KEY-FILLER PIC X(10).
      *                            VALUE LOW-VALUES.
           02 SVSE255-TRIAD-DATA.
              04 SVSE255-TRIAD-VAL-RD-EVENT
                                         PIC S9(13)V99  COMP-3.
      *           THE TOTAL RAND VALUE OF RD EVENTS ON
      *           THE ACCOUNT FOR THE CURRENT MONTH.
              04 SVSE255-TRIAD-RD-DAYS       PIC 99.
      *           NUMBER OF RD DAYS
      * RD-DAYS ARE DAYS ON WHICH AN RD EVENT OCCURED. NOT
      * A COUNT OF THE ACTUAL EVENTS.
              04 SVSE255-TRIAD-RET-PYMT-CNT PIC S9(3) COMP-3.
      * THE TOTAL NUMBER OF RETURN PAYMENTS
      *
              04 SVSE255-TRIAD-RET-PYMT-VAL PIC S9(13)V99 COMP-3.
      *           THE TOTAL RAND VALUE OF RETURN PAYMENTS ON
      *           THE ACCOUNT FOR THE CURRENT MONTH.
SG1410        04 SVSE255-TRI-LAST-DQ-CYMD    PIC 9(8) COMP-3.
  |   ***  DATE LAST DELINQUENT
  |           04 SVSE255-TRI-LAST-PUR-CYM    PIC 9(6)  COMP-3.
  |   ***  DATE (CYM) OF LAST POS TRANSACTION EXCEPT WITHDRAWAL
  |           04 SVSE255-TRI-RET-PMT-CNT-PRV    PIC S9(3) COMP-3.
  |   ***  NUMBER OF RETURNED PAYMENTS - PREVIOUS MONTH
  |           04 SVSE255-TRI-RET-PMT-VAL-PRV    PIC S9(13)V99 COMP-3.
  |   ***  VALUE OF RETURNED PAYMENTS - PREVIOUS MONTH
  |           04 SVSE255-TRI-BNKRPT-CHGOFF   PIC 9(8) COMP-3.
  |   ***  CHARGE OFF DATE
  |           04 SVSE255-RECENT-WDR-CYM      PIC 9(6)  COMP-3.
  |   ***  RECENT WITHDRAW CYM
  |   *       04 FILLER                      PIC X(06).
SG1410        04 FILLER                      PIC X(03).
      *
       01  SVSE255-UNI-MASTER-RECORD    REDEFINES
           SVSE255-RECORD.
      *                            UNITIZED ACCOUNT MASTER RECORD
           02 FILLER                     PIC S9(4)      COMP.
                88 SVSE255-UNIM-REC-LENGTH  VALUE +76.
                88 SVSE255-OLD-UNIM-REC-LENGTH  VALUE +44.
      *                            RECORD LENGTH
           02 SVSE255-UNIM-KEY.
             04 FILLER                   PIC S9(3)      COMP-3.
                88 SVSE255-UNIM-RECORD-TYPE VALUE 04.
             04 SVSE255-UNIM-KEY-FILLER  PIC X(10).
      *                            VALUE LOW-VALUES.
           02 SVSE255-UNIM-DATA.
              04 SVSE255-UNIM-GUARANTEED-AMT
                                         PIC S9(15)V99 COMP-3.
      *                            THE GUARANTEED AMOUNT FOR
      *                            REDEMPTION TO THE ACCOUNT HOLDER
              04 SVSE255-UNIM-UNITS-BAL       PIC S9(09)V9(6) COMP-3.
      *                            UNITS BALANCE ON ACCOUNT
              04 SVSE255-UNIM-UNI-BAL-STRT-HST
                                              PIC S9(09)V9(6) COMP-3.
      *                            UNITS BALANCE AT START OF HIST PER
              04 SVSE255-UNIM-HIST-START-DATE PIC S9(9)      COMP-3.
      *                            HISTORY START DATE
              04 SVSE255-UNIM-CAP-GAINS-AMT
                                         PIC S9(11)V9(6) COMP-3.
      *                            CURRENT CAPITAL GAINS AMT
              04 SVSE255-UNIM-CAP-GAINS-PRETXYR PIC S9(11)V99   COMP-3.
      *                            CAPITAL GAINS AS AT END OF PREV
      *                            TAX YEAR END.
              04 SVSE255-UNIM-CAP-GAINS-CURTXYR PIC S9(11)V99   COMP-3.
      *                            CAPITAL GAINS AS AT END OF CURR
      *                            TAX YEAR END.
              04 SVSE255-UNIM-SHORTFALL-AMT
                                         PIC S9(15)V99 COMP-3.
      *                            SHORTFALL AMOUNT TO BE PAID
      *
       01  SVSE255-UNI-DLY-MOVEMENTS-REC   REDEFINES
           SVSE255-RECORD.
      *                            CASH INDEX ACCOUNT DAYS MOVEMENTS
           02 FILLER                     PIC S9(4)      COMP.
                88 SVSE255-UNID-REC-LENGTH  VALUE +75.
      *                            RECORD LENGTH
           02 SVSE255-UNID-KEY.
             04 FILLER                   PIC S9(3)      COMP-3.
                88 SVSE255-UNID-RECORD-TYPE VALUE 05.
             04 SVSE255-UNID-EFF-DATE    PIC S9(9)      COMP-3.
      *                            EFFECTIVE/UNITIZATION DATE
      *                            OF MOVEMENTS
             04 SVSE255-UNID-KEY-FILLER  PIC X(05).
      *                            VALUE LOW-VALUES.
           02 SVSE255-UNID-DATA.
              04 SVSE255-UNID-EFF-DTE-DEPS-AMT
                                         PIC S9(15)V99 COMP-3.
      *                            TOTAL DEPOSITS FOR THE EFFECTIVE
      *                            DATE PROCESSED ON THE EFEFCTIVE DATE
              04 SVSE255-UNID-PRE-DTE-DEPS-AMT
                                         PIC S9(15)V99 COMP-3.
      *                            TOTAL DEPOSITS FOR THE EFFECTIVE
      *                            DATE PROCESSED ON THE DAY PRIOR
              04 SVSE255-UNID-PART-REDEMP-AMT
                                         PIC S9(15)V99 COMP-3.
      *                            TOTAL PARTIAL REDEMPTIONS FOR
      *                            THE DAY
              04 SVSE255-UNID-FULL-REDEMP-AMT
                                         PIC S9(15)V99 COMP-3.
      *                            FULL REDEMPTION AMOUNT FOR THE DAY
              04 SVSE255-UNID-SHORTFALL-AMT
                                         PIC S9(15)V99 COMP-3.
      *                            SHORTFALL AMOUNT FOR THE DAY
              04 SVSE255-UNID-UNITS-BOUGHT    PIC S9(09)V9(6) COMP-3.
      *                            UNITS BOUGHT FOR THE DAY
              04 SVSE255-UNID-UNITS-SOLD      PIC S9(09)V9(6) COMP-3.
      *                            UNITS SOLD FOR THE DAY
       01  SVSE255-ACCRU-RECORD          REDEFINES
           SVSE255-RECORD.
           02 FILLER                     PIC S9(4)      COMP.
                88 SVSE255-ACCRU-REC-LENGTH  VALUE +19.
      *                            RECORD LENGTH
           02 SVSE255-ACCRU-KEY.
             04 FILLER                   PIC S9(3)      COMP-3.
                88 SVSE255-ACCRU-RECORD-TYPE VALUE 06.
      *                            VALUE LOW-VALUES.
             04 SVSE255-ACCRU-KEY-FILLER  PIC X(10).
      *                            VALUE LOW-VALUES.
           02 SVSE255-ACCRU-DATA.
              04 SVSE255-ACCRU-DATE
                                         PIC S9(9)  COMP-3.
      *                            MANAGEMENT OF ACCRUAL CLOSURE DATE
AM1212 01  SVSE255-RETAILER-RECORD       REDEFINES
  |        SVSE255-RECORD.
  |        02 FILLER                     PIC S9(4)      COMP.
  |             88 SVSE255-RETAIL-REC-LENGTH  VALUE +34.
  |   *                            RECORD LENGTH
  |        02 SVSE255-RETAIL-KEY.
  |          04 FILLER                   PIC S9(3)      COMP-3.
  |             88 SVSE255-RETAIL-RECORD-TYPE VALUE 07.
  |   *                            VALUE LOW-VALUES.
  |          04 SVSE255-RETAIL-KEY-FILLER  PIC X(10).
  |   *                            VALUE LOW-VALUES.
  |        02 SVSE255-RETAIL-DATA.
  |           04 SVSE255-RET-SUB-PROD
  |                                      PIC 99.
  |   *                            RETAILER SUB-PRODUCT CODE
  |           04 SVSE255-RET-CLSE-NOT-DT
  |                                      PIC S9(9) COMP-3.
  |   *                            RETAILER CLOSE NOTICE DATE
  |           04 SVSE255-RET-FILLER
  |                                      PIC X(13).
AM1212*                            FILLER
       01  SVSE255-INDX-RTRN-REC          REDEFINES
           SVSE255-RECORD.
           02 FILLER                     PIC S9(4)      COMP.
                88 SVSE255-IRTN-REC-LENGTH  VALUE +28.
      *                            RECORD LENGTH
           02 SVSE255-IRTN-KEY.
             04 FILLER                   PIC S9(3)      COMP-3.
                88 SVSE255-IRTN-RECORD-TYPE VALUE 08.
             04 SVSE255-IRTN-KEY-FILLER  PIC X(10).
      *                            VALUE LOW-VALUES.
           02 SVSE255-IRTN-DATA.
              04 SVSE255-IRTN-INDEX-RET-PRE-TXY
                                         PIC S9(11)V99  COMP-3.
      *                            INDEX RETURN FOR THE PREVIOUS
      *                            TAX YEAR END
              04 SVSE255-IRTN-INDEX-RET-CUR-TXY
                                         PIC S9(11)V99  COMP-3.
      *                            INDEX RETURN FOR THE CURRENT
      *                            TAX YEAR END
AI1212 01  SVSE255-BTR-RECORD             REDEFINES
  |        SVSE255-RECORD.
  |        02 FILLER                     PIC S9(4)      COMP.
  |             88 SVSE255-BTR-REC-LENGTH   VALUE +56.
  |   *                            RECORD LENGTH
  |        02 SVSE255-BTR-KEY.
  |          04 FILLER                   PIC S9(3)      COMP-3.
  |             88 SVSE255-BTR-RECORD-TYPE VALUE 09.
  |          04 SVSE255-BTR-KEY-FILLER   PIC X(10).
  |   *                            VALUE LOW-VALUES.
  |        02 SVSE255-BTR-DATA.
  |           04 SVSE255-BTR-SEQNO
  |                                      PIC S9(09)  COMP.
  |   *                            BTR SEQUENCE NUMBER
  |   *       04 SVSE255-BTR-OPEN-BALANCE
  |   *                                  PIC S9(15)V99 COMP-3.
  |   *                            OPENING DAY BALANCE
  |   *       04 SVSE255-BTR-CLOSE-BALANCE
  |   *                                  PIC S9(15)V99 COMP-3.
  |           04 SVSE255-BTR-FILLER
  |                                      PIC X(38).
AI1212*                            SPARE SPACE
ML1303 01  SVSE255-DTC-RECORD             REDEFINES
           SVSE255-RECORD.
      *    DATED PRODUCT CONDITIONS
           02 FILLER                     PIC S9(4)      COMP.
                88 SVSE255-DTC-REC-LENGTH   VALUE +34.
      *                            RECORD LENGTH
           02 SVSE255-DTC-KEY.
             04 FILLER                   PIC S9(3)      COMP-3.
                88 SVSE255-DTC-RECORD-TYPE VALUE 10.
             04 SVSE255-DTC-EFF-DATE     PIC S9(9)      COMP-3.
             04 SVSE255-DTC-TYPE         PIC X.
                88 SVSE255-DTC-NOTICE-PER  VALUE 'A'.
                88 SVSE255-DTC-LIQUID-PERC    VALUE 'B'.
             04 SVSE255-DTC-KEY-FILLER   PIC X(04).
      *                            VALUE LOW-VALUES.
           02 SVSE255-DTC-DATA           PIC X(20).
           02 SVSE255-DTC-MIN-NOT-PER-DATA REDEFINES
              SVSE255-DTC-DATA.
              04 SVSE255-DTC-MIN-NOT-PER  PIC 9(05)  COMP-3.
      *                            MIN NOTICE PERIOD
              04 FILLER                   PIC X(17).
           02 SVSE255-DTC-LIQ-PERC-DATA REDEFINES
              SVSE255-DTC-DATA.
              04 SVSE255-DTC-LIQ-PERC     PIC 9(03)V9(4)  COMP-3.
      *                            LIQUIDITY PERCENTAGE
MV1510        04 SVSE255-DTC-LIQ-AMT      PIC S9(15)V9(2)  COMP-3.
      *                            LIQUIDITY AMOUNT
              04 FILLER                   PIC X(07).
      *
AI1307 01  SVSE255-EDW-RECORD             REDEFINES
  |        SVSE255-RECORD.
  |        02 FILLER                     PIC S9(4)      COMP.
  |             88 SVSE255-EDW-REC-LENGTH   VALUE +49.
  |   *                            RECORD LENGTH
  |        02 SVSE255-EDW-KEY.
  |          04 FILLER                   PIC S9(3)      COMP-3.
  |             88 SVSE255-EDW-RECORD-TYPE VALUE 11.
  |          04 SVSE255-EDW-TYPE         PIC XX.
  |             88 SVSE255-EDW-CRDT-INT-CAPT       VALUE 'CC'.
  |             88 SVSE255-EDW-DBIT-INT-CAPT       VALUE 'DC'.
  |             88 SVSE255-EDW-PRFT-SHR            VALUE 'PS'.
  |             88 SVSE255-EDW-INDEX-RTN-CAPT      VALUE 'IX'.
  |   *                    CC - CREDIT INTEREST CAPITIALIZATION
  |   *                    DC - DEBIT  INTEREST CAPITIALIZATION
  |   *                    PC - PROFIT CREDIT SHARE
  |   *                    PD - PROFIT DEBIT SHARE
  |   *                    IX - INDEX RETURN FOR NOTICE
  |   *
  |          04 SVSE255-EDW-KEY-FILLER   PIC X(08).
  |   *                            VALUE LOW-VALUES.
  |        02 SVSE255-EDW-DATA.
  |           04 SVSE255-EDW-CURR-INT-CAPT
  |                                      PIC S9(15)V99  COMP-3.
  |   *                    CURRENT INTEREST CAPITALIZATION
  |           04 SVSE255-EDW-PREV-INT-CAPT
  |                                      PIC S9(15)V99  COMP-3.
  |   *                    PREVIOUS INTEREST CAPITALIZATION
  |           04 SVSE255-EDW-FILLER      PIC X(17).
AI1307******    SPARE SPACE FOR FUTURE USE **********
ML1310 01  SVSE255-IDXLNK-RECORD          REDEFINES
  |   *    GENERAL LAYOUT FOR INDEX LINKED PRODUCTS
           SVSE255-RECORD.
           02 FILLER                     PIC S9(4)      COMP.
                88 SVSE255-IDXLNK-REC-LENGTH   VALUE +50.
      *                            RECORD LENGTH
           02 SVSE255-IDXLNK-KEY.
             04 FILLER                   PIC S9(3)      COMP-3.
                88 SVSE255-IDXLNK-RECORD-TYPE VALUE 12.
      *
             04 SVSE255-IDXLNK-KEY-FILLER   PIC X(10).
      *                            VALUE LOW-VALUES.
           02 SVSE255-IDXLNK-DATA.
              04 SVSE255-IDXLNK-INVESTMENT-AMT
                                         PIC S9(15)V99  COMP-3.
      *                    INVESTMENT AMOUNT
   |          04 SVSE255-IDXLNK-FILLER   PIC X(27).
ML1310******    SPARE SPACE FOR FUTURE USE **********
      * ---------------------------------------------------------
      * END OF SVSE255 SAVINGS DATABASE GENERAL DEPENDANT SEGMENT
      *-----------------------------------------------------------
