      * ---------------------------------------------------------
      *         A B S A  S A V I N G S  S Y S T E M
      *         ***********************************
      *
      * U N A V A I L A B L E   A M O U N T S   D E P E N D A N T
      *
      *                   S V D E 2 5 3
      *
NN1703*      TOTAL LENGTH = 65
      *      KEY LENGTH   = 10
      *
      *      PARENT SEGMENT = SVDE251
      * ---------------------------------------------------------
      *
       01  SVSE253-UNAVAILABLE-AMT-RECORD.
NN1703     02 SVSE253-REC-LENGTH        PIC S9(4)      COMP VALUE +65.
      *                            RECORD LENGTH
           02 SVSE253-UNAVAILABLE-AMT-KEY.
             04 SVSE253-UNAVAIL-AMT-REAS-CODE
                                        PIC S999       COMP-3.
      *                            UNCLEARED REASON CODE
              88 SVSE253-CHEQUE-DEPOSIT VALUE +1.
              88 SVSE253-ATM-DEPOSIT    VALUE +2.
              88 SVSE253-RETURNED-CHEQUE
                                        VALUE +3.
              88 SVSE253-AUTHORISED-AMOUNT
                                        VALUE +4.
              88 SVSE253-RESERVED-AMOUNT
                                        VALUE +5.
              88 SVSE253-PENDING-AMOUNT VALUE +6.
MDSW73        88 SVSE253-RESERV-FCT-AMT VALUE +7.
MDSW83        88 SVSE253-MSTRCARD-RESERV-AMT
                                        VALUE +8.
             04 SVSE253-EVENT-NBR       PIC S9(7)      COMP-3.
      *                            EVENT NUMBER
             04 SVSE253-SUB-EVENT-NBR   PIC S9(7)      COMP-3.
      *                            SUB EVENT NUMBER
           02 SVSE253-UNAVAILABLE-AMT-DETAIL.
             04 SVSE253-UNAVAIL-AMT     PIC S9(15)V99  COMP-3.
      *                            UNCLEARED AMOUNT
             04 SVSE253-UNAVAIL-AMT-CLEAR-DATE
                                        PIC S9(9)      COMP-3.
      *                            DATE AMOUNT WILL BE CLEARED
             04 SVSE253-CHQ-AMT         PIC S9(15)V99  COMP-3.
      *                            CHEQUE AMOUNT
             04 SVSE253-TRANS-SITE-CODE PIC S9(7)      COMP-3.
      *                            SITE CODE
             04 SVSE253-PROC-DATE       PIC S9(9)      COMP-3.
      *                            PROCESS DATE
             04 SVSE253-REF-NBR         PIC X(16).
      *                            REFERENCE NUMBER
NN1703       04 SVSE253-NRES-IND        PIC X.
NN1703*                            NON-RES INDICATOR
NN1703       04 SVSE253-NRES-FUNC       PIC X(4).
NN1703*                            NON-RES TRAN FUNCTION CODE
NN1703 01  SVSE253-SPARE-SPACE          PIC X(45).
      *                            SPARE SPACE
       01  SVSE253-VERSION.
           02 FILLER                    PIC X(11) VALUE 'END-OF-PARM'.
      *                            FILLER
           02 SVSE253-VER-NBR           PIC 99    VALUE 0.
      *                            VERSION NUMBER

