      * ---------------------------------------------------------
      *         A B S A  S A V I N G S  S Y S T E M
      *         ***********************************
      *         ********** N O T I C E ************
      *         ***********************************
      *
      *          R E N E W A L   D E P E N D A N T
      *
      *                   S V D E 2 5 A
      *
      *      TOTAL LENGTH =  150
      *      KEY LENGTH   =  5
      *
      *      PARENT SEGMENT = SVDE251
      * ---------------------------------------------------------
      *
       01  SVSE25A-RENEWAL-RECORD.
           02 SVSE25A-REC-LENGTH         PIC S9(4)   COMP VALUE +150.
      *                            RECORD LENGTH
           02 SVSE25A-RENEWAL-KEY.
             04 SVSE25A-DUE-DATE           PIC S9(9)   COMP-3.
      *                            DUE DATE
           02 SVSE25A-RENEWAL-DETAIL.
             04 SVSE25A-EVNO               PIC S9(7)   COMP-3.
      *                            EVENT NUMBER
             04 SVSE25A-DISCR-RATE         PIC S9(3)V9(4) COMP-3.
      *                            DISCRETIONARY RATE
             04 SVSE25A-INT-CAP-DAY        PIC S9(3)   COMP-3.
      *                            INTEREST CAPITALISATION DAY
             04 SVSE25A-INT-CAP-FREQ       PIC S9(3)   COMP-3.
      *                            INTEREST CAPITALISATION FREQUENCY
             04 SVSE25A-AUTO-TERM-EXT      PIC X.
      *                            AUTOMATIC TERM EXTENSION
             04 SVSE25A-REINVEST-CAP-INT   PIC X.
      *                            REINVEST CAPITAL AND INTEREST
             04 SVSE25A-INVEST-TERM        PIC S9(5)   COMP-3.
      *                            INVESTMENT TERM
             04 SVSE25A-LIQ-PERC           PIC S9(3)V9(4)  COMP-3.
      *                            LIQUIDITY PERCENTAGE
             04 SVSE25A-RATE-OPTION        PIC X.
      *                            RATE OPTION
      *                            F = FIXED, P = PRIME LINKED
             04 SVSE25A-PAYMENT-INSTRUCTION
                                           PIC X.
      *                            PAYMENT INSTRUCTION EXIST
             04 SVSE25A-RENEWAL-RECEIVE-DATE
                                           PIC S9(9)  COMP-3.
      *                            PAYMENT INSTRUCTION EXIST
             04 SVSE25A-RENEWAL-TYPE       PIC X.
      *                            PAYMENT INSTRUCTION EXIST
              88 SVSE25A-MANUAL         VALUE 'M'.
              88 SVSE25A-SYSTEMATIC     VALUE 'S'.
              88 SVSE25A-AUTOMATIC      VALUE 'A'.
             04 SVSE25A-RENEWAL-STAT-CODE  PIC X.
      *                            RENEWAL STATUS CODE
              88 SVSE25A-ADDED          VALUE 'A'.
              88 SVSE25A-CHANGED        VALUE 'C'.
              88 SVSE25A-PROCESSED      VALUE 'P'.
              88 SVSE25A-DELETED        VALUE 'D'.
              88 SVSE25A-REVERSED       VALUE 'R'.

             04 SVSE25A-TELLER-CODE        PIC 9(6).
      *                            TELLER ID
             04 SVSE25A-SUPERVISOR-CODE    PIC 9(6).
      *                            SUPERVISOR CODE
NN1610       04 SVSE25A-CRP-SCHEME-CODE    PIC X(10).
      *                            HMS CREDIT RATE PLAN SCHEME CODE
NN1610       04 SVSE25A-FILLER             PIC X(91).
      *                            FILLER

